Tekla Open API Reference for Tekla Structures 2025
OBB.IntersectionWith Method
Overload List
Name | Description
IntersectionWith(Line)
 Creates an intersection between the OBB and the given Line.
IntersectionWith(LineSegment)
 Creates an intersection between the OBB and the given LineSegment.
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace